// ConsoleApplication5.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

using namespace std;

int main()
{
	setlocale(0, "Russian");
	//Даны натуральные числа от 35 до 87
	// вывести на консоль те из них которые при делении
	// на 7 дают остаток 1,2 или 5
	for (int i = 35; i <= 87; i++)
    if ((i % 7 == 1) || (i % 7 == 2) || (i % 7 == 5))
		cout << i << endl;







	/*for (int i = 0; i < 10; i++)
	{
		cout << i;
	}*/
	// составьте программу, выводящую квадраты чисел от 10 до 20 вкл.

	/*for (int i = 10; i <= 20; i++)
	{
		cout << i * i << " ";
		cout << endl;
	}*/


	// Требуется определить , является ли год весокосным. Напоминаю, что год является високосным, если его номер кратен 4, но не кратен 100, а также кратен 400.
//cout << "Программа для выявления  високосного года\nВВедите год";
	//int g;
	//cin >> g;
	//// 5%5 = 0 5%2 = 5 && = И  || = Или 

	//if ((g % 4 == 0 && g % 100 != 0) || g % 400 == 0)
	//	cout << "Год високосный";
	//else
	//	cout << "Год невисокосный";


/* Даны три числа.
	Выведите  наибольшее из данных чисел (программа должна  вывести ровно одно целое число*/
	/*int a, b, c;
	cout << "Введите 3 числа";

	cin >> a >> b >> c;
	if (a > b && a > c)
		cout << a;
	if (b > a && b > c)
		cout << b;
	if (c > a && c > b)
		cout << c;

	else (a = a = c);
	cout << a;*/

	/* Требуется определить, бьет ли ладья, стоящая на клетке с указанными координатами
	номер строки и номер столбца, 
	Фигуру, стоящую на другой указаннной клетен. ВВодятся 4 числа: координаты ладьи- 2 числа и координаты другой фигуры(два числа)
	каждое число вводится в отдельной строке*/
	/*cout << "Программа для определения возможности ладьи.\n";
	int x1, x2, y1, y2;
	cout << "x1 = ";
	cin >> x1;
	cout << "x2 = ";
	cin >> x2;
	cout << "y1 = ";
	cin >> y1;
	cout << "y2 = ";
	cin >> y2;
	if ((x1 == x2) || (y1 == y2))
		cout << "YES";
	else
		cout << "NO";
     */

	//int a, b, c;
	//cin >> a >> b >> c; // 3 2 1
	//if (a > b)swap(a, b);// а = 2 в = 3
	//if (a > c)swap(a, c);// а = 1 с =  2
	//if (b > c)swap(b, c);// в = 2 с = 3
	//cout << a << b << c;

	
















}
	




	


